# HasPlane Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..HasPlane Method
CurveLoop Class See Also
---
Identifies if the CurveLoop is planar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasPlane()
```

Visual Basic
---
```text
Public Function HasPlane As Boolean
```

Visual C++
---
```text
public:
bool HasPlane()
```

# ### Return Value
True if the curve loop is planar, false otherwise.
# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace